import pandas as pd
a1 = "lalala" #вводим две переменные для работы с циклами
a2 = "lelele"
d1 = pd.DataFrame(columns=["ФИО", "Адрес", "Телефон", "Дата рождения"])#вводим DataFrame
while a1 != "завершить" : #цикл создания словаря
    a1 = str(input("Введите действие: Если хотите добавить человека в список - напишите 'добавить', чтобы завершить, напишите 'завершить':"))#вводим дружеский интерфейс, чтобы юзер понял что можно сделать
    if a1 == "добавить": #если юзер вводит добавить то предлагаем ему ввести данные
        name = str(input("Введите ФИО:")) #говорим ввести ФИО
        address = str(input("Введите адрес: "))#говорим ввести адресс
        telephone = int(input("Введите номер телефона:"))#говорим ввести номер телефона
        dr = str(input("Введите дату рождения:"))#говорим ввести дату рождения
        d1.loc[name] = [name, address, telephone, dr] #после ввода говорим записать все введённое в DataFrame, работаем через loc так как начали вводить в столбики
    else: 
        pass #pass — это пустой оператор (заглушка), которая просто говорит идти дальше
print(d1)
while a2 != "завершить" : #цикл действий
    a2 = str(input("Введите действие: Если хотите изменить адресс - напишите 'изменить', если хотите удалить человека из списка - напишите 'удалить' , если хотите просмотреть список - напишите 'просмотреть', если хотите завершить - напишите 'завершить':"))#предлагаем действия после того как юзер записал данные в датафрейм
    if (a2 == "изменить") : #если юзер выбрал изменить то изменяем адресс в датафрейме
        name = input("введите имя:") #просим ввести имя чтобы программа знала для кого именно имзенить
        address = input("введите новый адрес: ")#просим ввести новый адрес
        telephone = int(input("Введите новый номер телефона: "))#просим ввести новый номер телефона
        dr = str(input("Введите новую дату рождения: "))#просим ввести новую дату рождения
        if name not in d1.index: #если пользователь ввёл имя которого нет в списке то выводим ошибку
            print("Недопустимое значение")
        else : #если всё нормально и он изменил адресс существующего в датафрейме то дальше записываем этот новый адресс в соответствие имени            
            d1.loc[name] = [name, address, telephone, dr] #меняем датафрейм
    elif (a2 == "удалить") : #если юзер написал удалить то предоставляем возможность удаления записи
        name = input("введите имя:") #просим ввести имя, которое нужно удалить
        if name not in d1.index : #если такого имени нет, то выводим ошибку
            print("Недопустимое значение")
        else : 
            d1 = d1.drop(name) #если всё нормально и человек ввёл существующее имя, то удаляем его
    elif (a2 == "просмотреть") :#если юзер хочет посмотреть список, то пишем принт датафрейма и выводим ему список
        print (d1)
    else:
        pass #pass — это пустой оператор (заглушка), которая просто говорит идти дальше