import matplotlib.pyplot as plt
import matplotlib as mpl
import numpy as np
x = np.linspace(0.1, 3, 100) #Генерируем условные 100 точек от 0.1 до 3 для линий 
x_int = np.array([1, 2, 3]) #и берем целые [1, 2, 3], чтобы их выделить
# Рисуем линии графиков и сразу ставим значки на целых точках
plt.plot(x, x**2, 'b-', x_int, x_int**2, 'bo')          # функция параболы - x^2 - берем цвет синий blue (b), - пишем х_инт потом возводим в степень как и нашу функцию и отмечаем эти целые точки через (b) blue синий круг (o) = bo
plt.plot(x, np.exp(x), 'r-', x_int, np.exp(x_int), 'rx') # функция экспоненты e^x- узнаем команду и выводим благодаря нампай - даём ей красный цвет (r) red, отмечаем красными крестами целые точки перед этим пишем опять х_инт чтобы работало только для целых (rx), по аналогии с прошлой строкой
plt.plot(x, np.log(x), 'g-', x_int, np.log(x_int), 'gs') # функция натурального логарифма ln(x) - узнаем команду и выводим благодаря нампай  - даём зеленый цвет (g), целые точки отмечаем зелёным квадратом перед этим пишем опять х_инт чтобы работало только для целых (gs) по аналогии с прошлой строкой
plt.plot(x, x**3, 'y-', x_int, x_int**3, 'y^')          #кубическую функция функция выводим по формуле x^3 - даём линии желтый цвет (y), целые точки отмечаем жёлтым треугольником перед этим пишем опять х_инт чтобы работало только для целых  (н^)
#пропише команду плт.легенд чтобы вместе с функциями выводилось окошечко какой функции какой цвет и фигура на целых точках соответствует
plt.legend(['$x^2$', '', '$e^x$', '', '$\ln(x)$', '', '$x^3$', ''], loc='upper left')
plt.grid(True) #вводим команду плт.грид(тру) потому что она включает отображение координатной сетки на вашем графике.
plt.show()#командой плт.шов() выводим наш готовый график