import numpy as np
import pandas as pd
a = int(input("Введите размер N матрицы"))#просим ввести размер матрицы н
b = int(input("Введите размер M матрицы"))#просим ввести размер матрицы м
matrix = np.random.randint( -10, 10, size=(a, b))# генерируем матрицу рандомными числами от -10 до 10 и вводим рандит, чтобы генерировало целые числа, чтобы было красиво
print (matrix)# выподим матрицу
matrix_transposed = matrix.T #транспонируем матрицу
print (matrix_transposed) #выводим транспонированную матрицу
if a == b:#так как определитель матрицы находится только у квадратной матрицы обязательное условия будет: введённые размеры равны a=b
    det1 = np.linalg.det(matrix)#через команду считаем определитель матрицы
    det2 = np.linalg.det(matrix_transposed)#через команду считаем определитель транспонированной матрицы
    print (f"Определитель матрицы: {det1}")#выводим определитель матрицы
    print (f"Определитель транспонированной матрицы: {det2}")#выводим определитель транспонированной матрицы
    if det1 > det2:#сравниваем определители матриц, если определитель матрицы больше определителя транспонированной матрицы, то выводим:
        print(f"Определитель матрицы: {det1} больше чем Определитель транспонированной матрицы: {det2}" )
    if det1 < det2:#сравниваем определители матриц, если определитель транспонированной матрицы больше определителя матрицы, то выводим:
        print(f"Определитель транспонированной матрицы: {det2} больше чем Определитель матрицы: {det1}" )  
    if det1 == det2:#если определители матриц равны, то выводим:
        print(f"Определители матриц равны")          
else: print("для неквадратной матрицы нельзя вычеслить определитель")#если матрица неквадратная выводим ошибку

